{"id":"1", "text":". 1. How to do a garnishee. The applicant would like to enquire about how she could have her money returned to her.. Applicant wants to pursue the case still. . How can he enforce a money judgement.. Is it possible to put the claim as a personal one since the money was paid largely by applicant's company. . What is the best way to get the money from them?   What is the best way to stop him from doing this to others? . How to proceed with the process/documentation for the hearing date? . How can the applicant enforce this order?. . Can the applicant obtain remedy for property developer's failure to a) install the lock on the bedroom folding door; b) complete construction of facilities despite allowing owners to take over the property; and c) defective marble floors?. Whether her claim qualifies under Small claim.. Applicant would like to get his money back. What actions can he take against the directors.. Is CGH and/or the dealer of the PMD in breach of their contract? Can the C still request for other remedies after coming to an agreement with the respondent in the court order issued?. What are the possible avenues to move forward now that they have defaulted?   Can the directors be liable if the company does not have the assets? . . Plaintiff would like to know if he stands a good chance at filing a claim.. For how long will the enforcement of a court order be valid until? Will the applicant be able to be adequately compensated?. Is the applicant able to get back the money that she gave to the landlord?. The plaintiff is enquiring whether he should file for a claim against the company or a person. . . . . Client claimed that he is entitled to a sum of money pursuant to a court order (6/12/2004) at the end of his divorce proceedings in 2004. According to the court order, the client's ex-wife was supposed to make payment to the client of a sum of $3,000/month starting from December 2004. However, the payment is contingent on the determination of the spouses' divorce matter.. . Ms Looi wishes to claim compensation against the installation company, and wishes to know what options she has.. How can she seek enforcement against the  Adverse Party ?. What should she do because the Plaintiff is proceeding to auction items from the house. . Does she have to file the entire claim again?. How can Lai enforce the order?. Mr Chan wishes to know whether he should sign the settlement agreement, or proceed with the claim at the Small Claims Tribunal again. He also wishes to know if there is a possibility that the company would return the money without the settlement agreement.. Ms Yeo wishes to know how she can go about claiming her unpaid fees, as well as whether a claim under the Small Claims Tribunal would affect her employment.. Customer is displeased with the tribunal order and would like to find out what additional measure can she take.  The customer claimed that the respondent is a company's director and rented the house as a home office.  Customer felt that the claim should not have been taken up by the small claim tribunal. What are the odds of winning the case if they are to pursue the matter further legally?. What can she do? . Is the letter a court order?. Is there a way for him to claim $330. What is his cause of action after getting an order from the Small Claim Tribunals?. . Does Kenny have to re-file a new claim?. Can Leong recover the amount?. Applicant wants to enquire how to enforce the court order.. . . . Applicant wants to enquire who she should direct her suit to.   Applicant wants to know if she should sue for damages or failure to perform services.. . . Applicant wants to see how she can get monetary compensation.. How can the applicant claim the money back? . - Is there a more certain way that Applicant can use to get her money back?. Applicant want to know what to do to enforce judgement.. What legal action can the applicants take against the  Adverse Party ? . The applicant is seeking advice on the type of rights he holds since receiving the employment claims. What legal action may he take against the employer? . How can Applicant claim the ECT sum from his employer?. How can she get a refund of the $170 she paid for the botched treatment?. Should Applicant file his claim against the company or against his boss? If the company goes bankrupt, can Applicant still claim the amount from them?. Who should the applicant sue?. . Whether the applicant can enforce the judgment against his former employer.. 1) How to obtain the $4,500 owed to him. 1) How to prepare for the small claims tribunal hearing. 1. Can App deduct the cost of the TV from his deposit?  2. Can AP conduct a civil claim, or higher legal action, against him? 3. How to determine what is a defect, and what is fair wear and tear? 4. Can AP's wife represent him in the dealings? (short answer, yes) 5. Must App file a counter-claim? (short answer, yesss)  6. 3 access cards given to AP but only 2 given to App; they tried to claim one more from the tenant but he said he did not have it - how to obtain the card? 7. 'Tenant is liable to pay $150 for minor repairs'  . Small claims advised them to ask us if this claim falls under the purview of small claims tribunal.  . Applicant wants to know whether if there are any legal actions she can take against  Adverse Party .. 1) the applicant wants to know how she can argue that the balance payment should be $1,400 rather than $2,496.  2) the applicant wants to know how she can claim for the defective works  3)The applicant wishes to know whether audio recordings are admissible as evidence  4) the applicant wants to know whether they can claim for the flooring protection.. Whether the applicant can recover the debt by applying for enforcement.. . . 1) the applicant wishes to know whether they can claim from the company, or the director of the company.  2) the applicant wishes to know about the process involved in the enforcement of the money order.. Jurisdiction of the Small Claims. . The applicant wants to know what he can do to get back the debt.. 1) the applicant wants to know what he could do.  2) the applicant wants to know how much he would have to pay if he were to hire a lawyer  3) the applicant wants to know the deadline to file a claim at the small cliams court, and at the magistrates court  4) the applicant wants to know that in the event that he manages to get a court order for payment by the defendant, how he can obtain the payment  5) the applicant is concerned about whether he can proceed in an action against the defendant if the defendant is in jail . . She felt that it was unfair judgement . Whether the applicant can recover the sum of S$800.00.. 1) the applicant raised various concerns about how to do up an affidavit. . Whether the applicant can enforce the order against the renovation company.. . 1. Whether enforcing the order will cost much more than $2000, and whether it is worth the effort. . . Whether her brother-in-law would be able to enforce the judgment against the Company.. Enforceability of contract Interpretation of WhatsApp message.. Is it still possible to sue them?. Client wants to know his course of action, or if he should file for bankruptcy.. - Does the Applicant have to file a fresh claim or continue with the present action? - Does the arbitration clause oust the jurisdiction of SCT?. - How can the Applicant recover her deposit?. - How can the Applicant compel the debtor to meet the outstanding instalment payments. . - How can the Applicant recover for the amounts outstanding?. Is there any way to pay less?. How should he progress from this?. - Is there anyway for the Applicant to pursue his claim at the SCT?. Applicant wants to know if there are any ways for them to settle the case in the SCT. . Applicant wants to know what they can do, and whether they have to attend the Court? Can the case go to SCT, is a lawyer needed? . . . How to proceed with the case?. Client wants to know if he has any grounds to claim the losses he has suffered.. . How to present argument. Form for garnishee order, and how to recover the balance?. How to enforce the order?. How to enforce the order?. How to enforce the order?. 1. Is it possible to appeal the decision of the Referee or to reduce the judgment sum against the Applicant?  . 1. How can the Applicant serve the order on the Respondent, considering that the Respondent does not have a physical address?. 1) Civil matter: Claim through small claims tribunal 2) Criminal matter: The police will investigate, which will take some time. If there are suspicious activities, they may charge him in court for cheating.. a/p has refused to pay money after motor accident. applicant has helped to pay the damage cost. a/p refuses to pay the cost of $695. Can I get the deposit that I have paid to the contractor?. What are my options?. Applicant wants to get her money back. $9k+. How to get money back? Debt collectors or legal route?. How can Ms Saminam challenge the judgement?. Is Mr Ho's claim still valid?. How can Mr Zhuang enforce the judgement that he has received?. How can Ms Wee enforce the court order and award that she received?. What action should Mr Jacob take against the company that defamed him?. How should Mr Lee enforce his money order?. What should she do to recover the monthly rental owed to her?. How to enforce his defaulted payment since he had been avoiding contacting through calls, messages and emails. . How can Ms Koh get him to pay?. The kindergarten representative did not attend so what need to do for the following up. . Interpretation of the terms of the SCT Order.. How should I go about with the Small Claims Hearing?  For defects, how should I claim them from the contractors?. Can use deposit to make rental payment?  Whether justified for landlord to avoid hand-over?. Can she appeal against the trial judge's decision?. . The document have not been stamped. . There is an agreement between the Claimant and the renovation company.  However A maintains that no renovation was done thus far. Cheque issued by contractor for the refund bounced when A tried to deposit cheque for $16,800.00.. Are the terms of the contract unfair? Is there a duty of care between Applicant and Marketing Firm? How can Applicant avoid paying damages?. Client would like to know if the tenancy agreement is still valid without the stamp duties and whether or not the landlord can pay on his behalf and still make claims against him even though the tenancy agreement has already expired. . How does he calculate the interest. What can he do to enforce the court order. How can applicant make an appeal to small claims tribunal?. Whether the can enforce the order of tribunal claim.. What is the point of law and the issues involving the SCT order?. How should he go about paying in installments?. How to apply for a garnishee order?. Applicant wants to know how to ensure the other party is telling the truth as well as know how to ensure the other party cannot shift his assets away. Applicant would also like to know what would happen if the other party does not appear in front of court. . Applicant seeks to know how she should approach the Small Claims Tribunal case.  Applicant wishes to know if she can claim the shortfall to be paid to the CPF from the property (on the property agent's assurance that the Applicant would not need to top up).. A wants to know if she can claim even with the insurance waiver.. A wants his money back (about $9k in total), how can he go about doing this?. Applicant wants to know how to enforce the court order and ensure that he will be paid if the employer ever has money in any of her bank accounts. . Applicant wanted to know what he can do because his court order was rejected.. Enforcement of paper judgment by SCT. What can A to do salvage the situation?. What are the possible avenues for appeal or to continue pursuing the claim matter?. Can A exclude some items from the auction that belong to third parties?. Whether the Applicant can recover the collateral put for the loan amount and what she can do regarding the issue with the correspondence from the unknown lawyer at S K Kumar Law Practice.. How Applicant may enforce the judgement.. For items taken that does not belong to applicant, third parties have to file a interpleader. . . Applicant wants to know how to enforce money order.. How to enforce the court order?. Unsure of how to fill up the form Definition of judgment of order. What is the recommended course of action?. How to determine the residential address of  Adverse Party .. Whether the applicant will be able to recover monies owing to her by her ex-husband.  Whether the applicant can recover 2.5k paid to her lawyer who has not performed any services.. . The applicant needs to know what to do.. What should the Applicant do from hereon?. How should the Applicant proceed from here.. The client needs to enforce the tribunal order. . Garnishing proceeding. 1.Need to know what to do in response to Order of Tribunal and Writ of Summons.   2.How much would it cost to engage a lawyer?. Definition of movable items. Rights against the respondent. How can the applicant get the defendant to pay?. . How can Mr Christopher enforce the sum owed to him?. What will happen if Ms Then were to miss the tribunal?. Applicant wishes to return his rental car immediately. He does not want to pay the rental fees as it is unfair to him.. 1. How can the client seek legal recourse?. Whether the Applicant is able to stop the things from being auctioned.. Client has insufficient evidence for the small claims. . Client has been harrassed by debt collectors. . . . Is it possible for the applicant claim for her second piece of item? . The applicant would like to know how to go about appealing the case as she is not satisfied with the outcome in the small tribunal claims? . What are the three modes of enforcement?. How can  Adverse Party  claim back his deposit? . Is there any way the  Adverse Party  can appeal? . How to get the $3500 back. Contractual claim issue - the applicant would like to claim pursuant to the contract. How to align the format of her affidavit/documents with that of the Rules of Court . Is it worth commencing proceedings against the contractor for the repayment of $1300?. How to get his claim from the person to be claimed from? . How the applicant can go about claiming his $7000. . . Whether the applicant is able to file a claim in Small Claims on behalf of her husband, the party to the contract, to claim for a sum under the contract.. The applicant wants to enquire as to what to do with the court order from Small Claims Tribunal.. How can the applicant recover?. What should the applicant do procedurally?. What options does the applicant have/ how should he go about fulfilling the requirement of personal service?. Applicant wants a refund of the $300 deposit. . The Applicant wishes to know whether he can request to pay a lower quantum to the other party.. Service of Small Claims Tribunal order on a bankrupt company.. Applicant wishes to get payment from debtor before debtor potentially absconds. He wishes to find out the legal ways in which he can enforce his order for payment from small claims tribunal.   If debtor does not pay them back within the time period, what should applicant do?. Should the applicant hire a lawyer for this (i.e. preparing/ filing the relevant documentation)?. Is the method of hard-selling and detainment illegal? Can she obtain the refund?. Whether client should appeal against the decision of the registrar?  Whether a warranty covers unsatisfactory services?  Whether client can start a civil suit?  Whether SCT has proper reasons to reject the case?  Whether client requires expert evidence to back his allegations?  Whether the client can seek advise on the strength of his case?. Applicant wishes to know what are the options besides WSS.   Which option will be better?   Can the case be criminal?. How can the applicant pursue the case. . Whether there are any ways to get the defendant to pay up the sum?  Whether a lawyer should be engaged?  Whether legal costs can be recovered from the defendant?  Whether the client should sue the defendant in court for refusal to pay up the amount ordered by the small claims tribunal?  Whether there is any deadline to enforce the judgment?  Whether there are any ways to garnish the accounts?. Applicant wants to know what are the chances of success by filing an appeal.. . Can she claim for the money?. How can the court order be enforced?  Should the applicant proceed with the second claim?. I did not take a single cent from the owner. What can I do now?. What happens if I am not able to find for the actual person?   What happens the other person refuses to accept the post?. Can I take enforcement proceedings for my belongings in my house or the bank account?   How can I garnish the bank account?. The applicant questioned on follow up actions. . The applicant is worried that the other cars under this RightCar PTE LTD do not belong to the company itself.  The applicant inquired about the costs involved. He also questioned on the processes the applicant can take so as to seize the car. Furthermore, the applicant is worried that their company car might not be physically located within the office premises, thus making the seizing process harder.  The applicant questioned on what the lawyer would do if he were to be in his shoes. . The applicant enquired on whether or not the applicant can still launch a claim even though her husband is part owner of the property.  The applicant questioned on follow up actions that would be required if the tenant were to be incompliant to give 2 months renewal notice.  . The applicant questioned on whether or not she has to hire a lawyer in order to lodge an appeal.   . How can she get her money back? Can she enforce the court order? . . . Would like to know how she should conduct her case; whether her documents provide sufficient information  EJD . The applicant questioned on follow-up actions she could follow regarding the appeal.   . What sort of affidavit does the applicant have to submit?. The applicant seeks to enforce the judgement when the sum is due.  If unenforceable, the applicant wants to know if she can publicise the event online.. . How can the applicant claim the remainder of the sum against both Companies?. Next course of action.. The applicant seeks advice on whether to appeal the decision. The applicant also seeked to clarify certain terms within the contract.. Can she claim a refund. The options he has to get the sum of money.. Can the applicant file against the shareholder directly instead of the company? How can the applicant get somebody to court as the unit has been taken over? There was no appearances for the first application. How can the applicant enforce the court order?. How do they enforce the court order? How does the auction work? And what if the amount do not amount to $5000? How about the examination of judgment data? Can the defendant counter sue?. . . Whether she can get compensation for injuries suffered from use of the massage chair. How to get his deposit back?. What can he do with regard to his claim against the company?. How can she get back her $7000. The applicant wants to know how to defend the claim, and explore whether he has a claim against the client in return.. Applicant was advised that since there was no confidentiality agreement, there was no obligation that commercial parties keep information secret. There are many ways for commercial parties to obtain information on each other.  At any rate, this was a claim between two companies, so the applicant's individual rights are no at issue here. Applicant was advised that only if he was being attacked personally could he seek recourse in harassment laws   With regard to the applicant's company's claim, applicant was advised that he must show his case,. 1) What is an appropriate claim amount? 2) Any other advice when filing a claim with SCT?. . . Whether they should proceed with the order of seizure and sale.. Enforcement of paper judgment.. 1. What should she do in order to get the sums owed to her.. . The applicant has an order of court and wants to enforce the court order, and wants to do a garnishee. She has details of the bank account. . The applicant has an order from the small claims tribunal ordering an one B to pay her $4000 and $2800 respectively. However, the applicant could not find the B to pay the required sum. She is also unaware about any bank accounts which B owns.. Applicant made a claim for his motorbike deposit.  He paid $1000.  Applicant went to small claims and they dismissed his claim.  . Applicant is a landlord and wishes to enquire about enforcement of money order from the court of $20,000. The person who owes the applicant money paid the first installment of $500, and subsequently did not follow up. He wants to know what her options of. . Applicant has filed a small claim 2 months ago for a company that promised to provide birthday party services. However, 1k was paid by applicant's company and 50 from the applicant herself. . SCT claim amount for $2000.   Respondent has ignored.   Issue was the sale of a car.   WSS has been tried. . Went through the Small Claim Tribunal to claim expenses.   Signed up for a toe fungus treatment package but condition has worsened. Toe becomes scaly and also started bleeding intermittently. So client has stopped going back to the centre for treatment. Wants to claim back the remaining sessions ($3,000+ with them).  Initially went for clearing of dead cells but the salesperson recommended her the toe fungus treatment as she had a toe fungus inside her toe. Each sessions is $280 and there are 15 sessions in the package.   But did not see doctor as she wants to claim back the remaining sessions so that she can see a doctor proper. Also wants to prove the point that the condition is due to the treatment.   The Small Claims Tribunal is fixing a hearing date. Mediation has failed. . Applicant filed a small claims against a company . She made a payment of 500 to the company, but the company did not pay her back the monies. Applicant already has a court order against the company.. . 2 years ago, applicant booked a studio apartment in a condominium that was under construction. On 6 Mar 2018, applicant took key. Within first week, applicant submitted list of defects, including:   1.  Folding door outside the bedroom has no lock.  2. Condominium facilities were not ready when applicant took over the property. Full maintenance fees were charged despite the fact that these facilities were available only 3 months after applicant took over the property.  3. Marble floors were not sufficiently shiny. . Small claims Tribunal. She is the complainant. She has not filed the claim yet. It is about a 10 years warranty issue. She emailed to small claims to find out whether it falls within the jurisdiction of small claims because they have a limitation period of 1 year.   Facts of the case: She is given 10 year warranty. She has a renovation contract signed in 2012. For Corian products there is an international warranty (synthetic stone). They are supposed to give 10 years warranty but the thing cracked.   She has found a similar claim being made to the company. The company denied the claim and said that the product would not have possibly cracked and that the fault lies in the consumer's negligence.   Her corian tiles are cracking on the 5th year.  . Case on a newspaper with respect to a massage palour that closed down. Massage palour is at Yishun Safra.. PMD issue. 7 april last year until now, made complains regarding wheel issues, repaired 6 times the motor but the issue was never solved. One technician came by to replace all the parts once, but replaced the parts with 2nd hand parts. Client has no idea why and now he cannot get a proper solution despite going through official channels in Changi General Hospital.   Later in the session, C produces an order by session from the court that requires the respondent to change both back wheels and cover which amounted to a value of $300. . Applicant represents her company.  Other party defaulted on a tribunal payment totaling $12,000.   Other party is a construction company, likely a small time one.   . Applicant reached out to employment agency for a foreign domestic worker but the worker had some hearing issues. Applicant asked agency to take her back and replace her with another worker but they have not found a replacement for applicant and have also not refunded applicant. Applicant filed small tribunals case against agency but the agency no longer exists at the given address. Applicant has not gotten his money and cannot find the person in charge of the agency to make her pay.. Plaintiff paid for some renovation services in full. It amounted to about 6000 dollars. The owner of the company completed about 95% of the work. The plaintiff ordered some home appliances as well and paid in full. The owner is claiming that he did not receive a single cent and that he wants to counter claim. The owner is claiming that the salesman wrongly represented the company and dealt with the plaintiff. The plaintiff has evidence to prove that he paid for the renovation work.. Applicant is going overseas and is concerned about the court order that he received at the Employment Claims' Tribunal where he wants to be compensated for his salary.. Applicant rented an apartment. She said that she wants to get back the money as disbursement but there is a discrepancy in the money she wants to get back in two documents.. Plaintiff made a claim of $330 against him as a company but he was advised by the Registrar to claim against him as an individual. He was a victim of a scam. It was a contract related to cryptocurrency and mining of bitcoins. The respondent did not pay back the money and threatened to counter-sue.. Applicant concluded a court and there was a small claim order for his neighbour to make a payment of $6000 to him as compensation. After the bank transfer, there was a fee of $5980, after administrative charges. Applicant is worried that this will result in complications as the mediator previously said that $6000 was to be made, no more and no less. . Applicant enrolled her daughters into an enrichment class (My little Genius), for which she paid a full year (she has the receipt). The current amount she is owed is $1500. However one day there was a sudden notice on the door that they have closed in Singapore, and to contact a 'Desmond Chia' for details. However after a few emails, this man has ceased replies.   Applicant has checked ACRA, and the company is still alive. Applicant's friend who enrolled her child in another outlet managed to get a full refund back, around $2000.  Applicant previously filed a police report, and learnt that other reports by other people have been filed against this company. However after which she has received no news from the police.   Applicant has filed a case under Small Claims. However the defendant did not show up on the court date. She seeks advice as to what to do if the defendant does not pay.. Applicant rented a house from the landlord with multiple contracts within a 2 year period. After a 1 year contract lease, the applicant requested for 2 months extension. The extension was granted, and all rent was fully paid.  Following that, the Applicant contracted to stay for an additional year, but it was negotiated with the landlord that he would stay for an additional 10 months instead. The Applicant agreed and signed a contract with the landlord's agent (The Agent).  At the end of 10 months, the Applicant concluded the contract and wished to receive his deposit. However, the landlord refused, stating that the contract stipulated that he had to stay for 1 year in order to receive the deposit back, and that the 2 months he had resided did not count, and he had stayed only for 10 months and hence was not obliged to receive his deposit.  Applicant wishes to know what he can do. He has already been to Small Claims Tribunal, which could not assist him as the lease period was 2 years.    . . Submitted a small claims regarding her massage credit. The respondent did not turn up. Court has ordered for the person to pay $900. The client has to wait for the set date. If not paid, go to bailiff's office and the bailiff will get the person to pay. But problem now is the shop's physical space not there anymore so even the bailiff cannot help.   The massage shop's physical place has cleared out. But in the ACRA system, the company is still there.  Client had done a police report and alleged cheating. . Ms Looi installed an air-conditioner in her house. There was damage to her house after the installation. The company admitted that it was the fault of its workman, and promised to evaluate and rectify the damages. However, no action has been taken after a month even after repeated reminders. She went to the Small Claims Tribunal for help, but they referred her to OSLAS instead.. Applicant saw an advertisement for doing up windows and mosquito grilles for her new HDB BTO flat. ( Adverse Party : Timothy Yap) She paid a $1500 deposit for him to do the work, but he did not turn up and was uncontactable afterwards when she tried to contact him. Applicant has his address and has a case with the bailiff, but they said that they could not enter his premises.  Bailiff has suggested that she do a property search record to check up his details (however, this continually returned error messages even with lot history/record search). HDB title search did not yield any results, and it said that the lot is dead.   She managed to pull his address from ACRA, and while she had been filing the police report,  Adverse Party  changed his company name as well.  Adverse Party  refused to open his door when they first visited, and the bailiff has made a second appointment (today) to go to his place. There is a standing court order which applicant has produced.  Name on ACRA is Yang Seok Lian, so bailiff did not want to enforce the court order. Ms Lee has said that she has worked with Mr Yap in the past, and they are likely husband and wife.  Ms Lee has seen him in his car as well, but she does not know how to retrieve information on the ownership of a car.. Writ of Seizure. Her son was named in the writ and not her.   He bought items and paid installments. He is not working any more and thus cannot pay for instalments. Plaintiff applied into SCT and on 26th April he went on mediation, the judge asked the other parties to give him time to pay for instalments. However, the other party was unwilling and ask him to pay $500 or he shall pay full amount if he default the payment. The full amount is $3499.   She is trying to defend her items in the property since the Plaintiff demands for money. Notice states that the writ of seizure is taken up by the Plaintiff against her son and the WSS would be at this premise. . This morning went to SCT an d filed some claims on some travel insurance. She is actually suing the insurance company. Yap Ho Ching is the sole director of the insurance company and the representative. SCT stated that she cannot file 2 claims and they cancelled her claims. Her claim was only for $800 plus.   She went through a church with old folks and there was supposed to be an insurance coverage for the trip to Malacca. She tripped and injured her left foot when she was on the tour bus. The tour guide said he would act as witness and asked her to go ahead and get medical treatment. However, after filing up all the forms, the tour agent finally stated that they had actually not purchase the insurance coverage. . Lai has got a court order in Small Claims in her favour against the company respondent to pay her salary. Lai does general marketing work for the company. . Kevan Chan ('Mr Chan') ordered a package with a company named 'Elusyf' for a sum of $450. Mr Chan and his uncle filed an initial claim with the Small Claims Tribunal. Elusyf negotiated with Mr Chan out of court and agreed to refund the $450, provided that Mr Chan signed a settlement agreement. Mr Chan refused to sign the settlement agreement and wishes to commence a second action against Elusyf.  The Registrar at the Small Claims Tribunal advised Mr Chan to come to OSLAS to seek advice.. Yeo Hui Zhen ('Ms Yeo') was referred to OSLAS. Her case has been dragging on for more than 6 months. She was employed by an interior design company as a designer, and has since left the company. While she was trying to settle final payment (around $7000) for two of her pending projects, her employer was unwilling to pay.  Her main employment contract did not state in writing how the commissions and payments were structured. Rather, the payment structure was set out in verbal conversations and agreements.  Ms Yeo is currently employed in the finance industry. She wishes to know whether her action in the Small Claims Tribunal would have any adverse effect on her employment.. Deposit of $9900 and the repair of flooring cost more than $10,000.  Customer is the landlord. There was a hearing tribunal order and was entered against the landlord at $7000 and $20 as disbursements by 24 May 2018. . Mdm Lim paid S25,000 for 5 sets of goods but the person she paid to only delivered 2 sets of goods. She wants to get the 3 sets of goods or $15,000. Now she is only claiming for $10,000. The Small Claims Tribunal does not take her case because the case is a partnership agreement case, not direct sale of goods case. She talked to him to claim back the money or the goods but he kept ignoring her. . Sui has an agreement with B indicating that B will pay Amit a certain amount. B did not pay the amount. Sui went to the Small Claims Tribunal which provided Sui with a letter.. Applicant is an actor who has not been paid $330 for a one-time event he acted in and wants to claim back this amount. . On behalf of his sister, customer had went through the Small Claim Tribunals , respondent has not replied and a summary judgment was entered into against the respondent.. Customer had went to small claim tribunal and there was a claim against Jeremy Lee ( respondent ) did not turn up.  Online purchase which does not deliver the goods.. Kenny mistakenly stated in a claim in the Small Claims Tribunal as himself as the individual party when he should have stated it as his company. Tribunal was adjourned as court said it was the wrong claimant. Kenny will exceed the limitation period if they were to re-file as date of invoice would be more than a year ago.. Ming Kwang Air Conditioning is Leong's company. They did work for company called MG Engineering but the company did not pay. Small claims tribunal ruled asking MG to make 4 instalment payments of $2,000 each. When Leong submitted the cheque, it bounced and an Image Return Document was obtained.. Applicant filed a claim to SCT and got a court  order. Respondents breached their instalment plan dated 15 April. Applicant is unable to contact the respondent and he is no longer staying at his stated address (owned by his parents).. Applicant is enquiring regarding their roof awning in their condominium. They engaged their private contractors to build it in 2009 but did not know there was a 2m limit.   Verbal agreements with the MAs that their warning could be ignored. New MCSTs do not approve the size of their new awning. Last year December, MCST asked them to go to AGM and discuss it. It was discussed and agreed upon that the MCST would pay for the shortening of the awning from 3.6-2.8m, after CNY.  They received a letter enforcing that the shortening must be done in January. They wrote to them that they wanted it to be done by January, and they were willing to pay $1800. Cheapest quotation was $3200 and applicants said they were willing to absorb the excess (verbally), and asked for a new letter of agreement. They filed to SCT as they wanted to claim the full $3200.   Yesterday, the applicant received an originating summons from the MCST. . Applicant bought new HDB flat hence hired a contractor to do the flooring and full length cabinets. Before starting with the cabinets, checked the flooring and found that it was defective. There were some parts which was hollow, while other parts are uneven hence making it difficult to put in other furniture. Also, for the flooring for the toilet, supposed to be a slope based on new HDB requirements but when Applicant use water, the water flowed back into the bedroom instead of going into the toilet. Contractor engaged another service provider to do the flooring. Applicant wonders if the service employed was legitimate.  Contractor not under the HDB approved lease hence HDB asked Applicant to go and talk to the contractor herself. Applicant told contractor not to start with the cabinets and fix the floor first. Contractor insists that they can continue with the cabinets and that flooring cannot be perfect. When the HDB people came in to do the kitchen area, they said that the flooring got problem and when they checked, there were 8 areas in the living room alone where the flooring got problem.  The contractor continued with installing the cabinets instead of fixing the floor. Contractor engaged her own service provider (relative) to fix the cabinets. The sliding door cannot be installed cause the  door cannot be closed (got picture evidence). Applicant's son's door halfway cannot close fully, only close until halfway due to uneven flooring. When Applicant told contractor, she said that Applicant can go and engage other services to change the length of the door so that it can close. The contractor also said that not all doors need to be of the same length.  The guy in charge of installing the cabinet had to go and redo the door 2 times so that the door can be closed but told Applicant that it may not last for long. Applicant's mother also bought bedroom set but when they are installed, the bed was shaky and the floor was creaking. When they installed the cupboard, once again the door cannot be closed.  Applicant has  already been paying the contractor each time a section of the house is completed. Applicant have to pay the last payment of $7000. Applicant brought up the existing problems and defects once more and asked if she can be given discount but contractor said nothing can be done. Regarding the parts that are creaking, contractor brought in workers to make changes so the floor is no long creaking. However, when Applicant asked about the uneven parts, she was told that she will have to do that herself as that would incur more costs. Contractor also mentioned that since there are so many problems and they had to constantly keep redoing the work (for the cabinets), the work already take longer than it should be so they cannot give further discount.   Contractor filed a claim against Applicant under the small claims tribunal for not paying the final payment, hence are threatening to seize the things in Applicant's flat.  . Applicant has a judgement ordered against him due to a debt incurred over the purchase of a new car. The judgement has been entered against him for $10,000, because he did not file an appearance. The car company tried to work out a repayment plan with Applicant, but Applicant was unable to pay off the amount and tried to counter-propose a lower instalment amount. However, the company did not agree to Applicant's terms and is now commencing with WSS against him. . Applicant has an issue with a carpet cleaning company. The company came to clean her sofa and her rug but did not see any significant difference in the cleanliness of her sofa and rug. Applicant emailed the company who agreed to reschedule. They asserted they were unable to clean the sofa anymore but cleaned the rug with excessive chemicals and water it was very smelly. The company took back her rug and thereafter never returned her rug and her calls. Applicant filed a claim with SCT for $9000 ( damages to the rug, her white marble floor and cost of their services ) and the company finally replied. Company is a registered company but they are not legally allowed to clean homes.. Applicant is enquiring regarding a renovation issue. There was a verbal gaurantee there would be 1 year guarantee. Renovation completed on  14 Jan 2017. In April they noticed multiple defects in the renovation. Contractor agreed to send men over to fix the problem, but no one has been rectifying the problem. Contract is now expired and contractors are asking for applicants to pay to engage their fees. Applicants now want to claim for damages while they are asking new contractors to fix their home.. . Applicant bought a phone from Toa Payoh in December 2017. The phone was claimed to be brand new. Applicant noticed battery was faulty and returned to the shop, where he replaced the battery for her. Applicant's phone was still faulty subsequently.  Applicant ran a diagnostic with Apple for applicant and confirmed that the phone was bought on 1 Oct 2015. Applicant's phone would require $499 to repair.  Applicant has already filed a case with small claims tribunal and her hearing is on 2 May. . The applicant is suing his landlord,  Adverse Party , as he owes him $1000.  The applicant has been to the small claims tribunal. The  Adverse Party  has served the court order of $1000. The  Adverse Party  requested for a set aside. Applicant has received an SCT judgement in his favour, but  Adverse Party  is not willing to adhere by it.. - Contractor owes Applicant money since 26 January 2018. Court ordered for contractor to pay Applicant by 9 May 2018. - However, Applicant believes that Contractor would not return her money because Contractor is opening another store. - Contractor has transferred his old store to someone else. - Applicant is aware of Contractor's bank account number.. Applicant received an order of tribunal from SCT.. The applicants (husband and his wife) have engaged in the service of a contractor whos company name is Stonehenge,  Adverse Party . The applicant paid the contractor $14 500, representing 70% of the full renovation amount. Renovation was supposed to be done to the kitchen, living room, bathroom, bedroom and store room.  The renovation was supposed to be done by 16/02/2018.  Applicant only completed the store room and said he would provide them with a cheque of $12 800 as he did not complete the promised renovations. The applicant states the  Adverse Party  told them to bank the cheque after Chinese New Year 2018. Once the applicant banked the cheque in her bank account the cheque bounced back. DBS states the account of the contractor has been closed.  The applicants have filed a police report.  The  Adverse Party  has since relocated and is unreachable.   The applicant has sought the advice of a lawyer who's minimum fee is $6 000 and it is not sure applicants will be able to get the lawyer's fee back. . The applicant has received employment claims from a Private Limited Company. He has received an order from the employment tribunal. The applicant is owed $12 300.  The claim is against the ex-employer,  Adverse Party , regarding wages and investments incurred over the time he was employed at the company.   The ex-employer of a Private Limited Company is out of jurisdiction and unreachable. The employer had 70 foreign employees. They have received help from the MOM that states they will only get $2000. . Applicant had an ECT order given in his favour, with the payment deadline just passed without payment from his employer. . Applicant went to perm her hair at a hair salon. Her scalp was burned in the process. Hence, her perm was not completed and she was given another perm appointment. During the second appointment, her hair was cut, even though she was supposed to only get a perm. She was asked to pay outstanding $30 to the hair salon for the treatment. The hair salon has demanded she pay the outstanding $30, and has reported this incident to the newspaper, as well as posted a video of Applicant in the hair salon. Applicant now wants a refund of the $170 she paid for the botched perm. She has lodged a claim with SCT, and was told to come to CJC for enquiry. . Applicant worked a part-time commission-based job. He was not paid about $400 from his company. He has filed a claim with SCT but is unsure of whether he should file the claim against the company or the individual boss. According to an ACRA search, the listed company address is the same as the boss' personal residential address.  Separate issue: Applicant had previously paid $400 for a tuition teacher. But halfway, the teacher stopped coming and went away with all the money. Applicant does not have the personal particulars of the teacher. Can he claim this amount back from the teacher at SCT?. Applicant came from the Small Claims Tribunal. Applicant wants to get a refund of subscription fees. She purchased a voucher, and was charged subscription fees 7 times. It was charged to husband's credit card, and he just paid. Applicant went to CASE, and the other party proposed paying back 1 - 2 times only. CASE said she can go to SCT. Assistant Registrar in SCT said CASE wanted her to claim under Mike, but maybe that is not the right person to sue. Should sue streetdeal. The terms and conditions came from streetdeal. Subscription fee for premium membership is paid to streetdeal. AR suggested arbitration..  Uber called him and asked him to return his vehicle out of the blue. Stated that it was because a customer complained and they were terminating him. Following that, LCR told him that they are taking back his incentives and that they owe him back pay. Previously a vehicle that he had rented could not start - when he sent it in, nothing wrong was found; a few days later, he was traveling on the expressway when the car suddenly started malfunctioning (blinking lights) in the middle of traffic - fortunately it shut down only 1 traffic light away from the passenger's house. Following that, the car he had rented again malfunctioned (there was a loud bang and his car 'was driving towards the wall'). He also had an incident where the car malfunctioned, and there was no toolbox - even though he had repeatedly complained that there was no toolbox in the car.  He had several run-ins with Uber where he says that there were issues that he was dissatisfied about, including one issue where he claims he lost compensation because they were unable to provide him a vehicle that they had already agreed to provide.   LTA gave him a letter to tell him to stop driving (his license was suspended).   He claims that he got his license back and continued driving, but 'suddenly LTA took it away' again.  He managed to appeal and get it back - but he says LTA took it away again. He alleges that this time it was because of an administrative mess up on the part of Uber.   His legal issue is that they terminated him without reason (according to him) - he says that their stated reason was that he was speeding.   . The applicant has obtained a judgment from the Employment Claims Tribunal made in his favour against his former employer for the sum of S$5,400.00 sometime last year. The sum of S$5,400.00 was to be made to the applicant by September 2017. However, the applicant has not received any money from the Company up to date. The applicant has sent a Letter of Demand to the Company but there was no reply from the Company.. Applicant has a court order from the small claims tribunal where the other party was supposed to pay the applicant $4,500 (Tenant-Landlord issue). However, other party has not paid the sum as ordered.  Applicant is not entirely sure what the applicant's bank account number and her current residence. . Applicant was referred to CJC by CASE. Applicant employed a contractor to install a cooker hood. However, the applicant claims that a wire was cut off from elsewhere in her home to install the cooker hood (resulting in other appliances not being able to be installed). The contractor denied these claims. Applicant subsequently cancelled the contract (after paying 90% of the cost), asking for them to rectify the error. Again the contractor has refused doing so, claiming that there were no faults on his part, saying that the applicant must pay for the remainder of the contract fee.  CASE has informed applicant that she has the right to terminate the contract for improper work. Contractor later went to small claims tribunal (12th April) to claim remainder of the contract fee. Applicant had to contact another contractor to do the remaining rectification work and touch-up.  Applicant had previously told the contractor that she was willing to pay for the rest of the contract fee, if contractor rectified all other issues and completed the work. Contractor refused this offer. (verbal). - Bought unit at condo (resale) - AP is the tenant of the condo; dispute regarding the refund of the deposit - how much to deduct from the deposit to cover repair costs of defects caused by AP?  - AP claims 43 inch TV belongs to them, left a smaller TV; App only saw one TV before, inventory does not mention TV as well  - AP claims the TV is a lot cheaper than what App had suggested   - Aircon was working when App viewed the unit but when App was taking over from AP, AP claims it had not been working for 3 months  - $3000. Went to small claims court earlier and was advised to come here for advise. He sold his car at a loss to a car dealer. The car is on an outstanding loan of $24k, but the dealer convinced him to sell it at a loss, at $20k. The dealer told him to pay $500 for the dealer to clear the outstanding loan which would be offset from the final payment amount. The dealer accepted the $500.  It has been one month since they started negotiations. The car changed hands one month ago and since then the price has depreciated.  He decided then that it was taking too long and he wanted to take the car to another dealer.  However, when they collected the car to bring it elsewhere, the car had already depreciated in value (by around $2k), the car had a car part missing, and the dealer still owes him the $500 (since the dealer in the end did not achieve anything).  He now wants to claim for the $2k, the missing car part, and the $500 (there is a WhatsApp message confirming the receipt of the $500, as well as the ibanking transfer transaction). There is also a signed contract detailing what was originally agreed. . Applicant believes that she has not been properly notified of the collection of keys. Applicant admits that she forgot about the collection of keys after the initial letter, but her issue is with the reminder letter. While the developer did send out a reminder letter to Applicant's conveyancing lawyer ( Adverse Party ), Applicant believes that the  Adverse Party  did not convey the letter properly to her, sending the letter to her old yahoo e-mail which she no longer uses. Applicant is unhappy that there was no phone call or even an e-mail to the gmail account she currently uses. Applicant claims that there has not been enough effort to notify her of the reminder letter. Due to Applicant not collecting the keys, she has incurred loss as she had to pay for one month of maintenance and also the loss of income she might have obtained by renting out the property. Contact with  Adverse Party  has led to  Adverse Party  claiming that it was the fault of his staff not reminding Applicant properly.. The applicant had hired a contractor to do some works. The contractor is currently claiming a balance of $2,496 against the applicant pursuant to a written contract (or receipt). However, the applicant's position is that the balance payment should be $1,400 pursuant to a separate verbal agreement between them. The applicant had been asking for a revised quotation pursuant to a separate verbal agreement but up till now, had not received it. The applicant claims that the verbal agreement is captured by a WhatsApp conversation.  This issue is being contested in the Small Claims Tribunal.  The applicant also counterclaimed against the contractor for defective works (scratches on a glass panel) which the contractor claimed no responsibility for, and for uncompleted works. For the defective works claim, one issue was that the contractor was supposed to provide protection for the flooring. However, the contractor did not and claimed that they will only provide protection for places where work is done.   The applicant will be going back to the Small Claims Tribunal soon to provide documentary evidence/for further hearings.  . The applicant lodged a claim against a private limited company for the sum of S$10,000.00. The applicant supplied apparels to the company but the company did not pay up for the goods. The company did not turn up for the hearing. A default judgment was entered in favour of the applicant. The applicant did not know if the company has any other asset(s) other than a small shop located in Chinatown selling souvenirs. The company used to own 5 shops but has since closed down 4 of them. The applicant was advised by a friend of his to go for Examination of Judgment Debtor before he proceed with Writ of Seizure and Sale. The applicant wish to enforce the order on the company to recover the debt.. Case has been judged.  He is unsure what to do about the pipe. His claim is unsuccessful He is unsure if he should fix the pipe himself or if HDB will come and do it.  He is unsure if it is compulsory for him to let them come and fix the pipe.  He does not know what to do with the pipe. HDB claims that this is his pipe and he needs to maintain it himself. He wants to seal up the pipe.   . The applicant signed an agreement with Thinc Avenue LLP for advertisement on 9th November 2017. It is stated in the agreement that Thinc Avenue LLP would advertise for their 'School Doctor' programme on 30th November 2017, and over a period of 2 years on their directory. The applicant paid the sum of S$1,500.00 for the said advertisement. However, the applicant did not see any advertisement on their programme up to date. The applicant went down to the address provided in the agreement but found out that the company was not operating at that address. The applicant has lodged a police report on this matter. The police did an ACRA search and found that the company is live. The company was previously in debt and has changed their name to 'Thinc Avenue LLP'. The applicant has applied to claim for the sum of S$1,500.00 under Small Claims Tribunal. If the other party does not turn up for the next Small Claims hearing, the applicant can get default judgment.. The applicant wishes to claim unused prepaid medicure(?) packages from a company. the company was closed without notice. The applicant was trying to contact them but the only communication was through a facebook post. The applicant had tried to claim through the SCT, and the SCT told them they need more supporting documents including: - the vacant unit, the facebook post, and other documents.. Applicant engaged a renovator for his HDB flat but the renovator did not obtain a permit from the HDB before proceeding with the renovation works. Applicant visited the Small Claims to complain about the renovator, but Small Claims do not hear such cases.. . The applicant wishes to obtain a judgement debt against the defendant. An order has already been made against the defendant for $1,000.. The applicant had lent his camera to the defendant. However, the defendant did not return the camera to the applicant and is currently avoiding the applicant  The applicant went to the small claims tribunal. However, his claim was rejected by the small claims tribunal due to a lack of jurisdiction on part of the small claims tribunal.  . The applicant is claiming for a sum of money from a company in the Small Claims Tribunal. He needs help with filling the right name for the Defendant.. The applicant went to the small claim and the lawyers agreed to pay her. The dispute is between the applicant and the manager of the company. The company owes the applicant about 4k but it was set aside. She want to claim the commission but she was given a very unfair judgement. She went to the court and received an unsatisfactory order. The company did not pay commission and cancelled her agreement with the customer. The dispute was between the manager and her, even though she has served the customer, and was approved by the manager. But after the dispute, the manager claims that the customer was his when the applicant has already signed the agreement with the customer. Hence the applicant was not paid for her services and as sacked by the manager. The manager refuse to pay due to him arguing that she did not complete her job scope, but she argue that she did not have time to complete it due to it being dismissed. After the hearing, the amount compensated in the order was just overtime pay and the court has completely dismissed her commission fee of 4k. . The applicant made a claim against a pre-school via Small Claims. The pre-school has already closed down and is taken over by another company. The applicant is unable to serve the document on the pre-school company as the owner of the pre-school is currently in jail and the registered address of the company has been taken over by another company. The ACRA search result shows that the company is still live.. The applicant has a court order against a respondent for $5033.14. However, up to this day he has not received the money.  Yesterday, the applicant called the court for an enforcement order. The court told the applicant that he needs to go to the civil registry. The civil registry requested the applicant to do up an affidavit, of which the applicant is not sure how to go about doing it. . The applicant has an Order of Tribunal for S$3,000.00 from the Small Claims Tribunal made in his favour. There is an installment schedule. However, the applicant is worried that the renovation company would not pay up. The renovation company collected money from the applicant and promised him works. However, only part of the promised works were done. The renovation company refused to do carry out the rest of the works.. Area of law: Civil Claims (Small Claim Tribunal) and Enforcement. The applicant got an order against his former employer for the sum of S$446.00.  The applicant has a history of asthma. He was unable to go to work on one day due to his asthma problem. He sent his employer a text message to say that he is unable to turn up for work due to his asthma problem but there was no reply. The company did not pay him his salary after that.. His daughter was going to school, and the group was running a 12 to 13 branches. Due to some misadventure or something, the directors were involved in some fraud worth $5.9 million, and the directors were imprisoned for 8 - 10 weeks. The fraud was not related to the kindergarten business, and had something to do with obtaining Singapore citizenship. All branches of the schools were shut down. The fees paid in advance and the deposit were not returned to them. They have obtained an order, and the Registrar said that he would have to enforce the order.   MOE called all the parents up to try and find them new spots. The daughter had only just enrolled three months prior. . Court ordered for Buttercup Kindergarten to pay back $3265 Creditor with court judgement against them.. She is an agent acting for her brother-in-law in the purchase of a car. Her brother-in-law is the owner of the car while she is the one driving the car. An judgment is made in her favour for the sum of S$7,000.00 and S$20.00 for disbursement. The parties to the judgment are her brother-in-law and Auto Precision Pte Ltd (hereinafter referred to as 'the Company'). The Company has not made payment since some time late 2016. The only details that she has is the bank account number of the Company as the Company has transferred part of the payment to her previously.. Just came from Small Claims -  Same tenant in 2014, in the first year, someone else signed as a tenant; but it is still the same person. Someone else wanted to take over the lease because the previous tenant had already left the country.   From 2013; the payment has been coming from the same bank account.  Action for damages. Told to seek legal advice as to validity of contract and whether subsequent representations over WhatsApp have affected it. . Tenants have not been paying rent for the past few months.  Would like to sue them, but they have moved out and currently unable to locate them.. Client owes the defendant around $9000. Defendant has been approaching the client to obtain the payments.. - The Applicant bought wallpaper from a company ('Catalogue Singapore'). There was some issue with the combining of different pieces of wallpaper as there would be a clear edge when these pieces were placed on the wall. He wanted to recover for the cost of procuring a different wallpaper. - Applicant then filed a claim in the SCT against Catalogue Singapore, but was informed by Catalogue Singapore that he filed it against the wrong company. The company representative from Catalogue Singapore claimed that it was wholly owned by another company ('SHOPPING.COM NETWORK PTE LTD'). - The Applicant is also aware the SHOPPING.COM NETWORK PTE LTD may rely on an arbitration clause in their contract to argue that the SCT does not have jurisdiction to hear the matter.. - The Applicant previously rented a car from a rental company. - After returning the car, the company informed the Applicant that the handphone holder was faulty, and therefore refused to return her the deposit of SGD$200.00. - The Applicant has brought the claim to the SCT, to which they claimed that her claim fell outside its jurisdiction.. - The Applicant has a court order requiring another person to pay him in instalments - After a few instalment payments being made, the debtor has failed to abide by the court order - The Applicant spoke to the court bailiffs about this matter, but they claimed that they are unable to compel the debtor to make any more payments.. . - The Applicant received judgment against a private limited company for approximately SGD$10,000.00. - As the company refused to pay the amount, he filed for a garnishing order, but most of the liquid assets has been taken out of the company and the Applicant only collected approximately SGD$200.00. - The Applicant is now considering whether he can file for an examination of the judgment debtor.. In 2014, applicant set up internet service with MyRepublic. Applicant went overseas, and relied on the salesman from MyRepublic to terminate the contract. The salesman didn't settle it. Applicant wrote to MR. Applicant received a lot of calls asking for payment of debts. MR said that they got the order from SCT asking applicant to pay half ($3400).   Applicant was unemployed, own business not doing well, mother was ill. Applicant cannot afford so much. They allow instalment plan, but he still cannot afford it. He cannot even afford science tuition for his daughter.  Applicant did not check if he received anything from the SCT to appear before the tribunal.  MR did not care about his conversation with the salesman.. The client owns a condo and it has water seepage and leakage. This problem has been accumulating for years. There are patches and stains on the car due to the leakage and paint. The client wrote to the management and the stains have sunk into the car.  His own condo unit has issues with water seepage and his entire house and living room experiences water seepage due to the window. He is the only one filing the complaint. There is also the problem of bed bugs because of the dampness in the floor. His wife, son and him stay in this one bedroom apartment. . - Applicant seeks to recover his deposit from a contractor which he paid on 24 November 2016 as the Applicant alleges that the contractor's performance did not meet an agreed standard - At the material time, the Applicant also claims that there was no written contract signed between him and the contractor - The Applicant claims that the contractor initially agreed to refund the deposit - However, after repeated delays, the contractor eventually said that there was no right to a refund, and at present the contractor has left the company that the Applicant was dealing with - Applicant then filed his claim at the SCT on 24 November 2017 - Registrar at the SCT found that his claim was time-barred (i.e. falling outside the jurisdiction of the SCT), but the Applicant claims that the Registrar took the hearing date as the date that the Applicant filed his documents (December 2017), therefore exceeding the one-year time limit. Applicants' case was refused by the SCT because the case is beyond $10,000. Applicant and  Adverse Party  agreed to settle themselves. Now  Adverse Party  is not doing anything to settle the dispute. . The case is about second-hand motorbike deal between the Applicant and the another party.  Applicant is the respondent and currently was claimed against for selling a bad motorbike in the State Court. The amount claimed is $3000.  In the motorbike transaction, Applicant is the buyer and the  Adverse Party  is the another buyer. . Applicant signed contract with a company that authorized them to set up a company website for her; she already paid $3270 in 2016, which is 50% of the sum stipulated by the contract, and it was estimated to take at 4-8weeks. After 9 months, the website was unsatisfactory and hurt her business.The company demands the remaining balance.  Applicant went to meet the management of the company, and the management threatened to close the website. They eventually did on account of applicant withholding the balance.  Applicant wants not only keep the remaining balance but also whatever was paid already.  Had a hearing 15/1/18. Small claims tribunal held in favor of the company. . Applicant obtained judgment sum worth $450 against a company; obtained order from the small claims courts, he obtained an examination of judgment debtor . Contract with Colorado, small claims case. Ben Lim claims that he owns Colorado, but Colorado in fact is owned by Mr Soh.  . Client has filed an application with the Small Claims Tribunal. Client is suing a travel agency for amounts owed. Client claims that the travel agency forgot to submit his documents to the embassy, resulting his trip to be cancelled because he did not have the required visa to travel to the country. Client also incurred further losses such as hotel bookings, flight tickets and rail passes.  He also would like to claim the amount of pay he will lose for taking additional leave, and be compensated for his mental stress and suffering.. . Car purchase in 2016. Small Claims Tribunal argument.. Court ordered bank to disburse money, and the next step is garnishee order. Crimson Logic rejected their form and said it was the wrong. Claim is $10,000 but bank only has $1000+.  Another issue of car accident.. Company did not pay applicant his salary. SCT ordered company to pay but applicant has not received it. MOM said get a court order.. Company did not pay applicant his salary. SCT ordered company to pay but applicant has not received it. MOM said get a court order.. Company did not pay applicant his salary. SCT ordered company to pay but applicant has not received it. MOM said get a court order.. Applicant is a 76 yo female - she intends to rent her place to an Indian man. Prior to the negotiations between the two parties, the prospective tenant had paid the Applicant a deposit. Pursuant to a letter of agreement between the two, the Applicant claims that the Indian tenant has breached numerous terms, including one that prevents the wearing of outdoor footwear inside the house. Due to a breakdown in negotiations, the Applicant now refuses to repay the prospective tenant his deposit. The prospective tenant has initiated proceedings at the Small Claims Tribunal and obtained a decision from the Referee, ordering the Applicant to repay the deposit and costs against the same.  The Applicant now seeks to challenge the decision of the Referee, and alleges that she should be able to retain the deposit on the basis that she was denied the ability to loan the property to another prospective tenant.. The Applicant is of Russian nationality and is in Singapore on an EPA - working as an Assistant VP at Deutsche Bank.  The Applicant has received an order from SCT for a judgement sum for approximately SGD$2,500.00 against the Respondent company. The Applicant is unable to serve the order on the Respondent as the Respondent has vacated their registered address on ACRA. The Applicant claims that the Respondent still exists as a corporate entity, and that this has been verified by ACRA. . Extra facts: -Consultations at the small claims tribunal in the morning, outcome was that he did not pay stamp duty for the room rented. -Mr Dong did not know whether the address provided by the cheat was true or false. -Mr Dong has a copy of the cheat's IC.  According to Mr Dong, the counterparty cheated him by pretending to be the house owner and then took Mr Dong's money. He, the middleman, did not pass the money to the actual house owner. The actual house owner called the police. The cheat was there, but the police officer told them to let him leave first and gave a report number for them (Mr Dong and other persons affected) to go to the police station for the claim. Only then did he know he had been cheated. 3 months have passed since the police report.. - went to small courts, a/p hit applicant's car. - car workshop quoted $695.50 - after collecting the car and paying the fees upfront, applicant settled the $ - applicant sent a/p the invoice. a/p says he is overseas and will come back to settle the bill. - applicant went overseas and a/p keeps delaying - applicant says his mistake was to trust the a/p and should have reported irrespective whether a/p settled the accident or not. Renovation case, went to the small claims tribunal. Already got a judgment, if the contractor ignores the judgment, she has to follow the procedure for enforcement. But she does not understand the enforcement order.. Went to small claims tribunal, applicant is trying to claim from the company what they owe her. . Applicant is owed money but debtor refuses to pay. Has closed down his old shop and reopened a new one. . Tenant never made payment before leaving, and now cannot be contacted.No rent paid in 3 months, has also not paid the security deposit. In total, $6700 + more damages after owner checked unit. . Ms Saminam bought a gas stove. The shop claimed that it was brand new, and she purchased it. It malfunctioned a week later, and it was found the stove was a second-hand stove.  Ms Saminam's daughter lodged a police report, but was instructed to file a complaint at CASE. They were instructed to get the company to return the stove, but they refused.  The company later received a judgement against Ms Saminam for the balance of payment, but Ms Saminam had no knowledge of it. The company has already served Ms Saminam with a Writ of Seizure and Sale.. Mr Ho's treadmill malfunctioned when it was within the warranty period. The company refused to repair his treadmill.   He has already filed a claim in SCT.. A year previously, a person got in contact with Mr Zhuang, inviting him to an e-commerce seminar.  The person and Mr Zhuang entered into an oral agreement. Mr Zhuang attended one of the person's seminars, and handed over $2,000. However, no more seminars were held in 2017, and Mr Zhuang sought recompense.  He won a judgement in SCT for $2,000, and is looking to enforce the judgement.  . Ms Wee has a court order against a company, awarding her $11,686.70. The respondent appeared in court, lost the case, and left. The respondent has since refused to make payment.   The award is for unpaid salary, as well as wrongful termination of employment. Ms Wee has made an ACRA search for the company, and it is still in operation. The respondent is a sole proprietorship.. Mr Jacob was harassed online. He claimed that a company's service was not up to standard on their website, after they refused to deliver a product to Mr Jacob. The company defamed Mr Jacob on his LinkedIn page.   Mr Jacob filed a police report, and obtained a letter advising all parties to keep the peace. The Civil Registry advised him to report to CJC. Mr Jacob has been able to contact the company.. Mr Lee has a money order against a company from Small Claims Tribunal.  Mr Lee is unsure of the business model of the respondent, although he mentioned that they would go overseas and give talks on how to do business in Singapore.. The applicant is facing issue with a lady called Melinda Wong. Previously she had rented a property from the applicant and she had defaulted her monthly rental which had been delayed for many months.  And they had been given forged signature cheque from a third party which happened to be her ex-husband. Avoiding them since then for quite long. . The applicant facing issue with a person defaulting his payment after judgment given in a tribunal case.  He wanted enforced payment from this guy. Had tried to contact him but he had been avoiding.   That guy used to be his personal friend whom he met overseas. He went into business which needed a loan, the applicant invested a sum.. This is regarding commission for sale of property. The respondent claimed to own the property, but it belongs to the developer. He mentioned that he paid the deposit to the developer. He gave her the impression that he was one of the authorized representatives of the developer. Now, he says that he is not the owner and cannot pay the commission. The Registrar said that he can do partial payment. . The applicant is facing compensation fro his daughter's kindergarten.  Received a call from the MOE about the closure of her daughter's kindergarten. And she is graduating this year in n two month time and next year enter primary school.  Attended small claim tribunal and the kindergarten representative did not attend. the session.  Owned him around $900 plus in total.. His case is about an order in his favour by the SCT for $1K against Gain City for the purchase of an air conditioner.  The Respondent says that they are only obliged to pay for clause 2 provided he signs a service contract with them.. Small Claims Tribunal Matter - Engaged contractor. Paid 80% already. Two months later issued new quotation with higher price - $15,000.00. This is despite parties agreeing that there would be no hidden costs.  App spoke to contractor - contractor say don't pay he will withdraw all workers and stop work. He did so.  App send email to ask contractor to continue but did not agree to second quotation.  Contractor is claimant for unpaid invoice. App is respondent.. Small Claims Tribunal Matter - App being sued by landlord. Rented unit for girlfriend and sub-letted the other rooms to other people.  Landlord claiming for rental arrears - S$5,4040.75.  App claims owe nothing at all.  Matter is already in Small Claims with hearing date scheduled. Landlord want App to clean up unit before willing to accept hand-over. . Ms Elly just finished a trial at small claims and was supposed to pay $700 balance but she would like to appeal as she finds it unfair. The refrigerator she bought has scratches and stains. The Big Box representative told her that they can give a 1-for-1 exchange but they dragged the delivery for a long time. Ms Elly thinks that it is not fair that she has to pay for the second fridge and the fridge has oil stains and is producing loud noises.. . The applicant are facing small claims issue about renting a housing unit from a so-called property which is actually the owner. So far, contacting him had been a failure.  The rental for unit at $1200 monthly.. Applicant sought advise regarding renovation dispute. She informed she engaged CM Aluminium Windows & Doors to renovate  A is going to attend Small Claims tribunal consultation on 16/11/17 @ 8.45 am A informed that no renovation was initiated except for the hacking permission obtained by the contractor. As far as possible A is intent on claiming full amount of $14,800.00 paid to the contractor.  Contractor informed her that he is unable to refund the amount paid so far as he has gambled all the monies paid so far. He promised to refund her in instalments but has only repaid $600 after much compulsion. He informed her he owes many others monies. Contractor issued a cheque of $16,800 which bounced upon A depositing the cheque.  A  is concerned whether she should claim from the individual or company. . Applicant is a real estate agent and has a hearing in the afternoon. He signed a service contract with a marketing firm in 16 Nov 2016; 3 year contract, exit clause after 1 year. Terms and conditions were not shown to applicant. There were 2 versions of the contract; 1 without T&C, 1 with T&C. Applicant did not like advertising material that was prepared by firm and did not approve the publication of these works, but marketing firm went ahead to publish adverts. Applicant thus repudiated and terminated contract. Marketing firm sought damages of about $4200 for repudiation by Applicant.  Claim was lodged with Small Claims Tribunal.. Client has a tenancy agreement with the landlord and the client did not pay stamp duties. The landlord wants to pay the stamp duties on behalf of the client so that he can make further claims against the client. . Judgment in his favour in Small Claims, but the deadline was yesterday and he wasn't paid. He is in the process of filing an affidavit in order to garnishee.. Court gave him an enforcement order and now he want to execute the order. Recently the defendant open a new company, can he go to the new company shop to seize property. If the defendant's house is rented, can he still seize the property inside the house.. Applicant bought a 2nd hand van from Net Link Partners Pte Ltd. Neither applicant nor the company did not know  the 2nd hand van runs on diesel oil. After 2 months, the vans engine broke down. Company did not teach applicant how to maintain the van and this indirectly resulted to his van breaking down. Applicant filed a claim to small claim tribunal but the judge dismissed the case.  . Small claim of $1270 for salary. The Pte Ltd company has since closed and merged with another company.. Attended a hearing at the SCT on 161017. Applicant's tenant claims that the popping of tiles in the living room have made the house uninhabitable hence left to another house and terminated the agreement through email before the contract (12 months) ended. Applicant rectified the tiles within 11 days upon receiving notice. The judge at the SCT notified the applicant that he could appeal on the point of law, or if it is outside the jurisdiction of the tribunal  He is a landlord, confiscated tenant's security deposit as he claims that the tenant damaged the house and left without proper termination of contract. He wants to counter-claim of $20,000, capped out at $10,000. However, the judged dismissed the counterclaim and asked him to return the deposit  . Mr Goh was the customer of a molding product, which could not be sold due to defects in alignment. Mr Goh has to pay the claimant $1,800 for the product but he could not pay the full amount. He tried to ask for payment in installments but the seller did not comply. . Applicant has filed a claim against Prolife Biobank on 14 Dec 2016 amounting to $8,000.  Applicant has obtained a judgement order but MOM is not enforcing it so the company has not paid.   . Applicant is seeking a money order from an importer. He is currently going through the second stage of examining the debtor (EJD). He is owed $50,000 and did not know he could approach the civil registry, so he approached the SCT instead.. Small claims tribunal matter. Applicant signed an option-to-purchase of a sold property (the Applicant is the seller of the property) and the property agent is now claiming a commissioning fee percentage higher than what the Applicant is willing to pay. The Applicant contests the percentage, which she complains should be a negotiable amount as stated in the property agent's website. The property agent then filed against the Applicant in the Small Claims Tribunal.   There is a shortfall in the sale value of the property to which the Applicant must repay the Central Provident Fund (the 'CPF'). The property agent stated that the Applicant need not repay the CPF, in a bid to have the Applicant pay the higher commissioning fee.  The property agent has withdrawn the Small Claims Case against the Applicant.. A shifted house and A hired professional movers to shift her furniture. During the shift, she specifically instructed the movers to be very careful with her 2 Turkish plates and her husband's alcohol that they are very emotionally attached to. The moving crew changed twice, but when the crew was changed, the new crew was not informed of what must be moved carefully.  During the move, one of the Turkish plates was damaged. The plate costs $15,000. The moving company says that A signed an insurance waiver and she is thus only entitled to a claim of $20.. A signed a renovation contract. A needed a loan for this renovation project but the bank rejected his loan request on the basis that the director of the renovation company was previously a bankrupt. The renovation company then referred them to another company belonging to a friend of the director's dad. A paid this company 10% deposit before this bank loan was rejected.  So A signed a new renovation contract with the second company. A got the bank loan and paid the new company 10% but the second company suddenly reneged on the contract and refused to perform the contract.   Both renovation companies agreed that they will split the work 50-50.. Court order asked employer to pay him a certain amount by 22nd Sept 17, but the employer did not do so and is claiming to be bankrupt. The employer is a private limited company. . Applicant's ex employer did not pay his salary for his 1.5 month service. Applicant claimed that an court order was made already. . Applicant is claimant for company, wishes to enquire which the best course of action he should take. He was engaged to provide services for $3500. However, the other party has not paid outstanding sums owed to applicant for almost a year.   Applicant wants to enforce money order by SCT. . A was approached by someone, B, yesterday, claiming that he was from the State Courts appearing on behalf of her ex-husband, who is staying with her (they have agreed to do so for their children). A and her ex-husband are co-owners of the flat.  A did not let them into the house. After B called the police, the police told A that B is entitled to enter the property and begin seizure (under the writ of seizure and sale). A is concerned with the assets that has been seized (dining table, refrigerator, etc). A has children and this has affected her ability to take care of her children.  A claims that there is a stash of alcohol that the creditor may seize that will fulfil the amount of debt owed. The issue is whether the stash of alcohol belongs to the ex-husband or the ex-husband's company. . Applicant's claim in the small claims tribunal was dismissed. Applicant's claim was not filed in the small claims tribunal properly. The Applicant's appeal was rejected for being filed out of time and without the proper supporting documents. . A owes the bank a total of $16k. Her items have been seized and will be put up for auction.. Applicant owes a sum of money ($6,000) and is unable to contact the current lawyer who is corresponding with the Applicant.  Adverse Party  is represented by S K Kumar Law Practice. Applicant is trying to pay off the sum of money but has been finding it difficult to contact the lawyer who is corresponding on behalf of S K Kumar Law Practice.. Applicant is a 10% shareholder and partner of Arts Distillery ( Adverse Party ), who owes Applicant a sum of money. A judgement has been granted to state the same; however,  Adverse Party  has allegedly wound up and have sold all their assets.   . Applicant paid  Adverse Party  for a course at the school but the quality was not satisfactory. Applicant felt cheated to join the programme as he did not have much time to decide. Applicant was served a writ of seizure. Applicant did not acknowledge the notice to appear in the tribunal. . 1. Applicant wants to approach new company who has taken over the business of the liquidated company to get them to fulfil their service. She wants to know if it is necessary to produce the proof of debt as well.   2. Enforceability of court order from Small Claims Tribunal.  . Has court order for Mdm Teo to pay her back. Mdm Teo has paid her some of the amount, but not the rest. Asked housing agent to talk to her. She gave a cash cheque but crossed out 'or bearer' - cheque not a valid one. Asked agent to get a valid cheque but now Mdm Teo will not take calls.. Applicant is here regarding monies owed to her by her employer. There is a court order made as regards this payment.   She wants to know how to enforce the court order as against the debtor.. Applicant is here regarding the rectification of certain court documents. . The Applicant used to work at a photocopying company and was approached to set up a new business after the first folded. Hitachi is now trying to claim against the Applicant and her business partners refuse to pick up her calls. She has been paying a sum of $176 per month and is willing to continue doing so.. -Two agent sales of property. ( Adverse Party  is one of the agent while applicant is the other agent) -Co-agent was allegedly supposed to pay the agents' advertisements. -Applicant wants to pursue a SCT claim of $1,900, but do not have address of the  Adverse Party .. - Applicant is divorced from ex-husband ( Adverse Party ) -  Adverse Party  agreed in writing to return applicant some of her possession worth 25k but has not done so.   - Separately, applicant had engaged a lawyer previously and paid 2.5k without performing any services. The lawyer has now discharged himself/herself. She now seeks to recover the 2.5k.  - Third, the applicant has obtained C&C for the child. The applicant said that  Adverse Party  is supposed to pay maintenance for the child. However, applicant said that she does not know how much and there are no records.. The client had tried lodging a claim under the Small Claims Tribunal, but was advised by the Registrar to withdraw his claim. The claim involves a rental of a car. The client had rented the car to a company, who had in turn sublet the car to someone else. The car sustained damage and the client wants to recover the costs of repair from the company.   The rental agreement stated that the company would be liable to top up the difference between the repair costs and the insurance. This would amount to $2,700, but the company only wants to pay $1,000. The client thus wants to claim the balance.. Writ of Possession issued to the applicant.. Applicant was served a Writ of Seizure for the amount of some $3000 (principal sum was some $1300). Applicant has not over the 7 years received any notification for payment. Applicant had earlier paid some $500 to $600 but there was no formal record of these repayments. . Applicant has problem with his housing agent. He had paid one month of rent for the unit but the tenants in that particular unit refused to move. The agent then suggested other units. Applicant declined and wanted the return of the monies paid. The agent had given him a cheque but the cheque bounced.  Agent then credited the amount to Applicant's bank. There is still $700 outstanding.   He does not have the agent's address although he has the full name of the agent and company's name. Applicant has made a police report and has also gone to the Small Claims Tribunal.. The client's landlord had withheld his tenancy deposit of S$7701.65. He filed a claim with the Small Claims Tribunal, which scheduled a hearing to hear the dispute. The defendant however did not show up to the hearing. The court then ordered the landlord to make payment of $7701.65 + $20 (as disbursements) to the client. The defendant did not make payment by the deadline.. Applicant already got an order from SCT to collect $2000 from Spa.  First instalment is $500. Spa has subsequently defaulted payments.  Considering garnishing the Spa.  . Bought furniture costing $1,000. Had defects and sought to return it. Company failed to rectify furniture 5 times, so he returned it.. App has received a wss:  1. Movable property: Does not matter who it belongs to since the house in which the movable property is owned jointly by the app and his wife. However, his wife is able to file a notice of claim to court to claim back all the items that she 'owns'. (Would be ideal if she has evidence indicating she bought the items) Thereafter, the court has to really decide who the item belongs to. (i.e. if it belongs to the app, it may be seized)  2. Rights: Bank/respondent has to issue WOS against app for monies supposedly owed by him to the bank. They need to first obtain judgment against him. App's rights include a defence as to whether he truly owes a certain amount to the bank/resp.  . This concerns a court order for small claims ($1,000). The defendant has not paid the applicant. Applicant bought a car from the defendant and had to do major repairs requiring $1000.. The applicant runs a company with his partner (who is present today). The applicant runs an interior design works company.  In April, the applicant did a job with a company (Company A). The two directors of Company A then registered a new company (Company B). The directors told the applicant that from the registering of the new company, to send all invoices to Company B.  However, a job started in March this year, which incurred costs ($11k). The applicant had to claim for this $11k through small claims tribunal. However, the judge then said that the applicant sued the wrong party. The applicant hence is unsure who he should be claiming against, company A or company B, since invoices are sent to company B. Both companies are registered under ACRA.  The applicant feels more comfortable speaking in Hokkien, and proceeded to do so.. Mr Christopher is involved in a tenancy dispute in which he wishes to serve an order of court on the defendant.  However, due to the complications involved in the rules of court and the relevant forms, Mr Christopher is unable to enforce the sum owed by the defendant.. Ms Then negotiated with a contractor for renovation of her apartment. After paying a downpayment and having made subsequent negotiations, it was unilaterally decided by the contractor that the renovation works should not be proceeded with. The contractor has not attended any hearings for the dispute and has not shown any intention to reciprocate her attempts to settle the issue amicably and on more reasonable terms.  Ms Then has filed for and order of tribunal, during which she will be overseas.. Applicant has a rental dispute with Lion City Rental (& Uber). His Uber account has been suspended. He drives a rental car. Applicant approached Uber to immediately return the car but the company has not gotten back to him. As the car is still with him, rent is increasing. ($67 per day, pay by week, rental agreement says he has to give 1 week notice to return rental car.) . Client is a Bangladeshi worker. He has not been paid his salary since January 2017. He and his boss have gone to MOM but client has still not been paid. They went to court on 13 June 2017. The Employment Claims Tribunals has ordered the client's boss to pay the client a sum of $3736.25 and costs and disbursements $30. However this has not been paid. The client also owes his agent $8000 in agent fees. He has been in Singapore for 6 years and with his current company for 6 months. Client has not been working for 2 months.. The Applicant owes a credit card company a sum of money. The company has begun to auction the things in his house. The Applicant's wife claims to be the owner of the things auctioned.. Applicant's claim dismissed due to insufficient evidence. . Client has an order by Court to make payment to the claimant. She has already made payment on 20th May. Claimant filed application on 15 May. . MyRepublic saleman informed the client that there was no promotion for a free router and the client signed the contract. She was later informed that there was a promotion at that time. She contacted Customer Service and was promised the original promotion, as well as $100 (compensation). However, the person she spoke to later reneged on his promise, despite repeating his promise for three consecutive calls.. The client has obtained a tribunal order and is seeking advice on (a) whether she ought to cash in the cheque of $2,500, and  (b) garnishing proceedings. She is also seeking advice on whether she ought to file for an Examination of Judgment Debtor. The company is not yet insolvent.. The applicant managed to get a refund through small claims tribunal from a retailer for her first piece as it was not in good condition. The applicant anticipated that the second piece would be in the same condition and wants to claim a refund for it as well. . The applicant has been brining her cat to a vet for 8 months. The cat was sick for 2 months and the doctors at the vet clinic carried out Traditional medical traditional on the applicant.  But the cat did not get better after the acupuncture treatment. The applicant initially refused to pay for the treatment as it did not help the cat. However, the clinic said that the applicant had to pay and she complied.  The applicant went to the small claim tribunals thrice and she failed. . The applicant has not received some money from the respondent's company. The respondent owes over $2000 for an order but has refused to pay on request. .  Adverse Party  moved out of apartment and owner did not return the deposit.  Adverse Party  went to Small Claims - ruled that respondent should pay. Respondent has failed to return the money and time by which he should have done so has lapsed. .  Adverse Party  filed a claim on the basis that respondent agreed to do certain IT works for  Adverse Party 's company.  Adverse Party  is sole proprietor. Respondent claimed they did the work and referee accepted respondent's claim.  . He sold an item for $3500, but the cheque bounced. He has already received a small claims order of tribunal but does not know how to get his money back. . The applicant engaged a contractor to conduct some renovation works (Kitchen cabinets). The contractor had received payment, but the contractor kept dragging on the works for over 3 months. The judge ruled that the contractor was doing works pursuant to the contract, and hence the applicant lost half of his deposit (approx. $1000).  The judge was satisfied that the clause stipulating that the deposit was non-refundable, was a contractual agreement, and hence enforceable.  The applicant would like to appeal from the SCT judgement. He is unclear of how much he should claim, and is considering whether he should claim for appeal fees, lawyer fees etc.  During a meeting between the applicant and the contractor, they had agreed on a timeline. However during the hearing at SCT, the contractor claims that this was merely an estimate and was in no way a promise. This persuaded the judge that this was still a work in progress and hence dismissed the claim.  The applicant is currently unemployed.  The applicant went online and found more similar cases of this contractor dragging cases on. This was presented to the judge in SCT, but it was dismissed.  The contractor, during the hearing at SCT, produced evidence that he had been fabricating a cabinet, but this was not communicated to the applicant. . Registrar said that Applicant's prayers is defective. Registrar told Applicant to align her prayers with Form 100 . Engaged a contractor for $7000. He caused damages amounting to $1300. He refused to pay the damages. She made a police report. His business was seized by ACRA. Mdm Lam has a tribunal order dated 16 March 2017 ordering the contractor to repay her. . The applicant had been granted to claim $10,000 from the person he filed a claim against in the small claims tribunal. However, he has not been able to claim the amount since even thought the person to claim from has $10,000 in his bank account. . The applicant has had a small tribunals court case previously. The judgment requires the applicant to be paid $7000 for his claim. However, the person he has to claim from refuses to pay back the $7000 and only wishes to pay back $2000. . The applicant received a summon from the bank to cease the house. . She has claimed a Small Claims against a renovation contractor. The contract was not signed by her, but her husband. He is unable to take leave to attend to claim, so she has to do it for them. The contractor was supposed to hand over the house, but they failed to do so several times, and some works were not completed. . Applicant informed that she was a wedding planner, and one of her customers did not pay up. $1400 is still owed. The applicant has a judgment from Small Claims Tribunal..  Adverse Party  did not return the deposit to the applicant despite a court order. The applicant lacks the details of  Adverse Party .. Applicant rented an apartment and  Adverse Party  did not pay applicant despite a court order.   Applicant had received an garnishee order. Court has asked applicant to personally serve notice to person who owes applicant monies ( Adverse Party ) of $6.800 in order to proceed with case. However,  Adverse Party  cannot be found at his property.  Applicant visited  Adverse Party  at the same premises a year ago, but  Adverse Party  does not own property and is only a tenant.  Adverse Party  is a Singapore PR. . Applicant signed a contract with a company that provided them with several 'trial' products. Applicant lodged a claim at Small Claims Tribunal for the refund of a $300 deposit. Applicant was given several 'trial' products that could be returned if deemed unsuitable. Products are unsuitable but the sales representative is requiring applicant to make payment of $300 and an additional fee of $4000 for other products.     . The incident that occurred in December was that the other party claimed that the Applicant and his friend failed to complete certain phases of the construction work by the stipulated deadline. Also it was claimed by the other party might not have applied for the necessary licenses and documents to proceed with the construction works. (URA and HDB)  The Applicant was not present during the construction works. However, the Applicant's friend has attended 3 meetings at the Small Claims Tribunal and was ordered to pay the other party $8000. The Applicant is not financially able to make the necessary payments as of the moment.. Applicant is seeking advice regarding claims to Small Claims Tribunal. Matter concerns a hair-dressing salon company where the applicant had purchased a hair-dressing package from the salon. Applicant wanted to seek advice concerning the order given by Small Claims Tribunal on the company. Applicant informed that the company is currently bankrupt, and is seeking advice as to whether she has any cause of action against the directors of the company.. Applicant received an order from the small claims court.  It is in applicant's favor, but applicant fears that defendant would not obey the order from the small claims court. . . The applicant has demanded payment from a tour company since last year, but to date, the adverse party ( Adverse Party ) has not paid up. The  Adverse Party  is not a private limited company.  The applicant wants to seek legal recourse through the Small Claims Tribunal.. Applicant bought a Spa package from Ensoga in December 2016. The applicant's mother utilized the package in April 2017. After the applicant's mother finished her facial she was informed that they have given her an upgraded facial with stem cells, and was charged $128 for it. The applicant's mother agreed to the upgraded package. The staff at the Spa then brought her to a small room and tried to hard-sell their product, specifically a 6-time package that costs $1100. The staff allegedly detained and harassed the applicant's mother. The applicant's mother to give them her credit card to pay for the $128 package, and signed the receipt without paying much attention to the details due to being tired and stressed after the ordeal. However, the next day the applicant and his mother found out that they were charged for the 6-time package as well. Applicant's mother contacted the company the next day for a refund but was refused.. Client took out a claim against a company, Optiworks. Optiworks void his warranty for a car. The warranty was for 8 years. The client realised that the petrol consumption of the car is very high, and when he told the Optiworks that the car engine has something wrong, they refused to provide him a solution. Hence, the client went to another workshop to change the engine oil and Optiworks told the client that since he used another company's engine oil, his warranty is void. The client went to the Small claims tribunal, but S17(3) Small Claims Tribunals Act was used, where the SCT told the client that his  case falls outside of the jurisdiction of the SCT. The damage includes cost of petrol.   Client merely wants his warranty reinstated, but the company refuses to give him back his warranty. . Applicant has an order from the Small Claims Tribunal, against a timeshare company. . The applicant filed a case at the small claims tribunal but the other party did not pay. They have moved away from their old address and has been uncontactable since. . Client requires an enforcement order for judgment given to her in the small claims tribunal, where the defendant has to pay $1,500.00 to the client.. Applicant filed against a renovation firm as the firm dragged renovation into a few months.  Applicant attended 2 consultations with the Small Claims Tribunals and submitted all her documents very early. Respondent only submitted in mid-March.   Applicant is dissatisfied with the referee from SCT. Respondent can only compensate $1500 but applicant is dissatisfied, however she was only asked if she accepts the amount. Applicant originally claimed $10 000.   Applicant feels it is an unfair decision as she submitted her documents earlier but she only received the respondent's documents on the day of the hearing in chamber. She claims that the referee did not look through her documents. . Has an order of tribunal from small claims tribunals. Respondent forfeit to pay. Enquire what if Respondent does not pay?. The client bought a holiday package from Chan Brothers and opted to pay in full instead of installments like what she wanted to do. She is not formally employed. She has high blood pressure and her blood pressure surged. She went to hospital for a check up and was advised to not travel. She told the tour leader and her seat was cancelled.  She filed insurance but was not allowed to claim any money. Chan brothers gave her a letter in writing to ask her to claim for the insurance money. The insurance company said that there was a pre-existing condition that said that she cannot claim.   Her contention is that she should be able to claim and that the fine print should not be held against her. She asserts that since she did not consume anything, she should be able to claim for insurance. . The applicant is attempting to enforce an order from the SCT. A garnishee order has failed due to the judgment debtor not having any funds in the bank account the order was obtained against. The claim is only for $120.  There is a separate matter involving a dispute sum of $70.. He is the main contractor. The sub contractor came together with him. The contractor has done up to 80%. The owner has asked the main contractor to pay $10,000. The owner has completed 80-90% payment.   The owner has asked to make additional changes to the construction but the he has not paid. The sub contractor has stopped work due to this.   Sub contractor made the payment transactions under the main contractor's name. Now the owner has asked the main contractor to be responsible for the $10,000.   The judge at the SCT mentioned that the main contractor was unlucky and he is responsible to pay. . On 24 March, the client came to small claims tribunal. He met the Judge and they told him to find the person's name. Identify the correct person.   The client was attacked and he had to send his watch for repair. He send the invoice through A.R post. . The other party appeals this case and he is in America. Yesterday was the last day of the order but they have rejected the appeal. The other party has to pay the client.  The client is the tenant. . The applicant's respondent did not attend the case and is ignoring notices. This is a case involving second-hand car. This car broke down immediately after the purchase. The company involved is Link Auto.. The applicant purchased a BMW  320i at $95k last year October. There was a gear box issue and under the contract and the dealer promised to fix it. The car was unable to reverse on the first day. The company invovled is RightCar PTE LTD. The applicant has claimed for 7k cash order for repair fees under Small Claims Tribunal. This same company has been sued recently for 20k. The applicant is now considered a creditor since the company has already been sued for 20k by others.  . The applicant's tenant has signed an tendency agreement in advance regarding a renewal. However, the tenant has decided that she does not want to renew. There was no diplomatic clause previously, however the applicant's tenant now desires one.  The applicant has written down her husband's name as the owner despite the fact that the applicant is the sole owner. . The applicant's house was damaged. Under the lease contract, there was a security deposit of $2800. The applicant's pipes and marble floors were damaged badly. The applicant claimed money for the retiling of the floor. However, the tenants ignored this claim. Even though the applicant went to the Small Claims Tribunal ($5000), she only received $955. The applicant is dissatisfied with this order. . The client bought a piece of furniture but the company (Lushor) did not deliver it. That was a year ago. She asked for a refund for the furniture so she went to the Small Claims Tribunal. The tribunal has issued a money order, but the company still did not pay her the $540.   The client wishes to get her money back from the company. . Client has taken on a yoga service contract last year. In April, the original proprietor wound up, and resold the business to a new company, which agreed to honor all the previous contracts.   In November, the applicant was informed that he would have to purchase additional packages from the new owner of the business, or his contract would be terminated otherwise. The other party claims that the initial agreement to take over the contract was out of goodwill, and no longer stands.   Applicant is attempting to lodge a claim at SCT against the original owners of the business, but is unable to do so as the company is no longer operating in Singapore. SCT requires him to serve the notice on the respondent before they can commence any actions. . Court order to repay some sums of money to Ms Loke from a company called TS. TS is currently not active. Ms Loke is claiming that the person in charge of TS changed the name of the company to avoid paying the fees to Ms Loke.   There is debt recovery plan for TS to follow, but he does not return the money to Ms Loke. He is a Malaysian, Ms Loke does not know his address.  She wants to know how she can enforce payment from TS?. Upcoming hearing for civil claim - renovation dispute in small claims tribunal. Applicant claims that the renovator did not perform contract as agreed.  Hearing is scheduled for Wednesday, 15th March 2017. Applicant believes that the contractor (defendant) performed at least about half of the work agreed to. . The applicant has a court order on 2 March. She has used beauty products and she has launched a refund on her treatment package from the beauty salon. The salon produced 3 false documents at the end of the court trial. However, the applicant only read these documents a day after the trial. The applicant feels that these documents have resulted in unfair conclusions. In conclusion, the applicant desires a larger sum from the beauty salon. . 3 years ago, the applicant asked for a refund on a plane ticket which he did not make it in time for.  The court has asked for the bank account as evidence to show the transaction made for the purchase of the plane ticket.. The applicant has filed a claim with the SCT and has gotten a default judgement for $300. The claim is against a cleaning company that has not performed its job.   As of now, the applicant is pretty sure that the company would default on the payment when due and thus, is seeking anticipatory advice for enforcement.. curtain installer - renovator refuses to finish job name and add is wrong  name is wife's name but mr  went to SCT but installer did not turn up. The applicant is involved in a small claims. The applicant has subscribed with a company A for a salon treatment/package. Company A then referred the applicant to Company B  to claim the remainder of the treatment. However, since Company B has also closed down to their knowledge.  Both Companies have closed down their store front and the applicant still has a remainder sum from her salon package.. The applicant was allegedly harassed by her fellow tenants. Various verbal abuses were made to the applicant. The applicant has since moved out from the property. The applicant's fellow tenants have filed a claim for breach of contract at the Small Claims Tribunal. The contract was signed between the applicant and the owner of the property. The applicant does not have a copy of the contract.. Applicant has submitted a claim that has been dismissed. The claim was filed under the small claims tribunal against a foreign domestic worker and her agent.  The tribunal found that the maid was of competence and there was a contractual agreement regarding refunds and cancellation. Issues also concerned the maids escape and a letter written by the maid chronicling her predicament.    The applicant feels that the tribunal has not fully taken into account her evidence and her arguments during the small claims hearing.   The applicant admits that she was very emotional in chambers and thinks that this might have affected the decision of the tribunal.   The applicants stance is that the maid is not incapable, but is working under the agreed scope of work. There have been prior arrangements and acceptance by the maid and the applicant thinks that the maid is just trying out the job and requested for a transfer on the fourth day of work.  The applicant has accordingly reduced the workload to accommodate the work but feels that the maid has already made up her mind once she requested for the transfer. The maid has ran away to the agents house and the agent has since been rather uncooperative.  There are dispute resolution clauses within the contract of the applicant and the agency.  There was also a police report filed by the agency with other issues concerning the maid's wages.. Complaint about a training course which doesn't give what it claims. The course is called easypreneur, which is meant for online affiliate marketing. She attended the seminar, which promised that without any IT knowledge, and without any large effort, she can earn money through directing traffic to amazon etc. The total amount paid out, and claimed, is $2,229.  She tried it out, but it turns out that it not only involves high levels of IT knowledge and requires additional payment etc. She wrote in to ask for a refund, but the respondent told her to come for a final seminar. During the session, she was told that there was no refund, and to succeed she would need to further invest more money into the system.   The applicant lodged a complaint at the Small Claims Tribunal. Counselling was arranged but the respondent did not turn up. The Registrar at small claim tribunal told the applicant to seek legal advice before reconvening to decide whether she wants to continue her claim. Other party lives in the same condominium as the client. Client made payments to the other party's bank account.. The applicant is making a claim against a hair salon, which is a pte ltd. The applicant has signed a package with the salon and the hair salon has ran away.  The hair salon has ran away and the applicant has since filed a claim against the hair salon according to the address in ACRA. The notice of consultation was deposited in the mail box of the registered address. The respondent did not respond to the notice, possibly as the shop unit has been taken over by another company at that point in time.  The applicant has also already since gotten the order of court for the claim.. They want to claim $5000 from SG Vehicle (the defendant) but the defendant did not turn up for the hearing and now they want to enforce the order.. Client ordered a sofa, company did not deliver. Made a police report and posted a message on the company's facebook page. Multiple other victims of this 'scam'. Found out that the owner of this company has carried out similar scams in the past. Shop has closed. Notice was served but company did not turn up for the hearing. Client has informed CAD.. Whether the defendant can set aside the court order. Repeated ask for the order to be set aside. After the case, the respondent offered to pay half the amount.. In 2011, bought a massage chair but recently the machine has caused injuries on the skin of her foot. Doctor told her within two years the inflammation will subside but this has not happened till day. She has been referred to skin specialists and she wishes to claim compensation from the company. Went to small claims to file for a $10, 000 compensation but company has refused to pay.. Tenancy agreement. Signed on 28th December, though stated (as agreed) on 25th Dec. As he signed, he saw a leakage from the ceiling. He was told that it would be fixed, but it was not. Assured that it would be fixed before the signing, but repair was not done by the time the tenancy was supposed to begin. Leaking problem, according to the landlord, was only fixed on 7th January. Applicant told them that he wanted to terminate the tenancy as he lost his job, he would pay 1 month rental, but he wanted to get his deposit back.   Tenancy agreement states that if he pays $4999 from the deposit, he can terminate the agreement.  Made a claim at Small Claims Tribunal.. Applicant is a claimant. Wishes to enforce order against a pte ltd company. Amount over $10,000.. Applicant rented a condo units for 2 years. During their meeting at the end of the agreement, the landlord requested for certain renovations work to be done and so she agreed although she felt some of them were a bit unreasonable. The landlord even asked for extra compensation of $10,000 thereafter.  The landlord then says that the works done amounted to almost $7000 and hence would not return her $7000 deposit.. The applicant is a sole proprietor of a construction company. He is now subject to a Small Claims Tribunal case. He is accused of overcharging his client, and for item defects.. Applicant went to small claims because Respondent did not pay his company any money for certain services. But in the Respondent's evidence, the applicant found a photocopy of an invoice concerning a transaction between him and a third party supplier. Applicant was surprised that the respondent managed to get hold of the invoice since he never told the respondent about this transaction and thinks that he is being stalked/followed.   Respondent has also been falsely claiming that the Applicant's company did not complete the services, and the respondent has been hiring third parties to do rectification work to prove this point.. Applicant has IPL package with a beauty company. She paid $1,500 for package, but sustained burns because of the treatments. Burns are not very serious; she consulted a doctor, but consultation fees are minimal because she went to a clinic on her university campus.  Applicant is planning to pursue a case with the Small Claims Tribunal (SCT).. Applicant owns a maid agency. Customer says that the maid is crazy and wants a change. Applicant went overseas for 2-3 weeks and thus did not turn up in court. Customer claims against the applicant.. Applicant hired a web designer. Respondent doesn't give any supporting evidence and said that 80% of the work was completed. They asked applicant to pay 80% of the amount for the work done. Applicant claims that the Judge did not consider her evidence and wishes to appeal the decision from the SCT. Applicant has already paid 12k to the web designers.   Applicant claimed 10k from the designers in damages.. Sold car to a company and cheque has been issued but it bounced.  Claim of 3,500 (balance).  Gone through small claims tribunal but ineffective.  Order of tribunal issued but recipient did not turn up. Order of seizure and sale also issued.. Plaintiff has received judgment against director of company that has ceased operations. Has not received judgment sum and is unable to enforce judgment because defendant has claimed negative equity.  Plaintiff has also called ACRA to verify if the company is still solvent but the company could possibly wind up in March.  However, Plaintiff's concern is that the company no longer has property left to seize. Wishes to recover her $7000.. 1. used to have a lawyer who acted for her. Letter was dated last year. 2. Respondent has still not paid applicant even after the judgement.  - Respondent was supposed to pay $200 per month  - but Judgement does not elucidate the agreement - no order of court"}